[
  {
    "path": "posts/2021-05-22-my-1st-post/",
    "title": "DataViz Makeover 01",
    "description": "Design truthful and enlightening data visualisation of Merchandise Trade for Top 6 countries by year 2019 and 2020.",
    "author": [
      {
        "name": "Li Yumeng",
        "url": "https://nicetry.netlify.app/"
      }
    ],
    "date": "2021-05-29",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1) The original visualisation\r\n2) Critiques and suggestions for current visualisation\r\n2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3) Proposed Design\r\n3.1 Sketch\r\n3.2 Desigh ideas\r\n\r\n4) Data visualisation steps\r\n4.1 Data preparation\r\n4.2 Data visualisation\r\n\r\n5) Final visualisation\r\n5.1 Snapshot of dashboard\r\n5.2 Main observations\r\n\r\n\r\n1) The original visualisation\r\nFigure 1: Chart of Merchandise Trade by Region/Market, 2019 – 2020\r\nNotes:\r\nDataset refers to Merchandise Imports & Exports By Region/Market\r\nSource: ENTERPRISE SINGAPORE, Data last updated: 17/05/2021\r\nBefore making over the selected visualisation, it is important to have a clear understanding of the context of the visualisation and its key takeaways which are dependent on:\r\nWho: Top six trading countries all around the world.\r\nWhat: Drawing the visualization graph and getting a better understanding of merchandise trade of these six countries over the past 2 years (2019 to 2020).\r\nHow: Showing the import and export numbers as well as distribution and making comparison analysis of six countries.\r\n2) Critiques and suggestions for current visualisation\r\n2.1 Clarity\r\n\r\n2.2 Aesthetics\r\n\r\n3) Proposed Design\r\n3.1 Sketch\r\nFigure 2: Sketch of proposed design\r\n3.2 Desigh ideas\r\nFirst of all, bar chart shows the absolute numbers of trading volumes in 2019 and 2020 for the six countries which provide the whole picture of the trading performance; then use pyramid chart to give the detailed export and import performance of six countries over two years.\r\n4) Data visualisation steps\r\n4.1 Data preparation\r\nRemove unnecessary rows and columns for sheet T1\r\nDelete rows 1-5 and 127-140 and filter targeted rows, which are six targeted countries; Keep columns which are targeted time period, 2019 and 2020.\r\nFigure 3: Remove unnecessary rows and columns\r\nDo the same steps for sheet T2\r\nCombine sheets T1 and T2 Combine two sheets together, add one more column “Import/Export” to differentiate and rename the country names for concise purpose. Figure 4: Combine two sheets\r\nPivot data Import file into Tableau, select all the years, right click and select “Pivot”. Figure 5: Pivot\r\nRename headers and change data type for columns Rename ‘Variables’ to ‘Country’ and change data type to geographic role - country. Rename ‘Pivot Field Names’ to ‘Date’ and change data type to date. Rename ‘Pivot Field Values’ to ‘Trade Value’.\r\nFigure 6: Modify headers and data type\r\n4.2 Data visualisation\r\nCreate line chart 1.1 Drag [Country] and [Trade Volume] to Columns and Rows respectively. \r\nFigure 7: Create line chart\r\n1.2 Sort by Trade Volume and Update view from ‘Standard’ to ‘Entire View’. 1.3 Add reference line for Trade Volume Apply average trade volume for six countries and custom label for the reference line, formatting the line at the same time. Figure 8: Add reference line\r\n1.4 Format reference line Change the font color to red and use currency format for numbers. Figure 9: Format for reference line\r\n1.5 Drag  to Label, and format labels with bigger size and bold font, also in custom currency format without decimals. Figure 10: Add label\r\n1.6 Hide field labels ‘Country’ for columns 1.7 Drag  to color and choose color blue for year 2019 and color orange for year 2020 1.8 Rename the chart title as ‘Trade Volumn of Top 6 Countries by Year 2019 & 2020’\r\nCreate line chart\r\n2.1 Analysis - Create calculated field for ‘Import’ Figure 11: Create calculated field\r\n2.2 Same step for creating field ‘Export’ 2.3 Drag [Country] and [Import], [Export] to Rows and Columns, respectively.\r\nFigure 12: Choose variables\r\n2.4 Edit Axis for , reversed the scale Figure 13: Edit axis\r\n2.5 Sort for Import in descending order 2.6 Convert to percentage : * Right click [SUM(Import)] > Quick Table Calculation > Percent of Total. * Right click [SUM(Export)] > Quick Table Calculation > Percent of Total.\r\n2.7 Drag Date to color for SUM(Import) and SUM(Export) respectively, and choose color blue for year 2019 and color orange for year 2020 2.8 Drag Import to label, bigger the font size, change to white color and bold as well; format the numbers to percentage without decimals.\r\n\r\nFigure 14: Change label format\r\n2.9 Update view from ‘Standard’ to ‘Fit Width’. 2.10 Rename the chart title as ‘Proportion of Trade Volume by Year 2019 & 2020’\r\nCreate dashboard\r\n3.1 Add sheets Add sheet “Trade Volume” on the top and sheet “Trade Proportion” to the bottom. Retain one year band legend, place it at the right corner.\r\n3.2 Add title Click the checkbox “Show dashboard title” and add title : “The Trade Volume and Proportion of Import/Export by Year 2019 and 2020” with font size 20 and put in center. 3.3 Add source Using Objects > Text > drag to bottom left and add : “Source: Department of Statistics, Singapore (https://www.singstat.gov.sg/))\r\n5) Final visualisation\r\n5.1 Snapshot of dashboard\r\nFigure 15: Dashboard Full visualisation available at Tableau Public\r\n5.2 Main observations\r\nIn year 2019 and 2020. Mainland China has the highest trade volume among the top six trading countries, followed by Malaysia. The figure of the US also beyond average benchmark. Other countries, i.e. Taiwan, Hong Kong and Japan are below benchmark regarding to the total trading volume over two years.\r\nLooking into year 2019 and 2020 separately, Mainland China still remain the top 1 place for total trading volume. The rank remain stable for other countries as well.\r\nThe rank of import volume for six countries is similar to the rank of total trading volume, except for Japan, which figure exceeded Hong Kong.\r\nThere are some changes of rank for six countries with regard to export volume, Mainland China still remain the top 1, which followed by Hong Kong, Malaysia, United States, Japan and Taiwan.\r\nMainland China had the undisputed strength towards overall trading performance, while Hong Kong had the smallest figure for import volume but surprisingly performed good at export performance.\r\nThe proportion of export and import is similar for all 6 countries from 2019 to 2020. Mainland China, Japan and Hong Kong remain exactly the same. The percentage of export for Malaysia increased 2%; the US’s import dropped 3% and export dropped 2%; the import proportion of Taiwan increased 1%.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T11:41:57+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Lemon's Blog",
    "description": "Welcome to My new blog, DataViz Blog. I hope you enjoy \nreading what I have to say!",
    "author": [
      {
        "name": "Lemon",
        "url": "https://r4dsa.netlify.app/"
      }
    ],
    "date": "2021-05-26",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-26T15:34:01+08:00",
    "input_file": {}
  }
]
